<template>
    <!-- 顶部区域 -->

        <!-- Navbar区域 -->
        <Navbar></Navbar>
        <!-- Navbar区域 -->

    <!-- 顶部区域 -->

    <!-- 主体区域 -->

        <!-- 左侧边栏 -->
        <!-- 左侧边栏 -->

        <!-- 二级路由 -->
            <router-view></router-view>
        <!-- 二级路由 -->

    <!-- 主体区域 -->

    <!-- 底部区域 -->

        <!-- 歌曲封面 -->
        <!-- 歌曲封面 -->

        <!-- 上一曲、暂停、下一曲 -->
        <!-- 上一曲、暂停、下一曲 -->

        <!-- 进度条、时间 -->
        <!-- 进度条、时间 -->

        <!-- 播放模式 -->
        <!-- 播放模式 -->

        <!-- 音量 -->
        <!-- 音量 -->

        <!-- 播放列表 -->
        <!-- 播放列表 -->

    <!-- 底部区域 -->
</template>

<script setup>
import Navbar from './components/Navbar.vue';


</script>